# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
print(f'Логическое "И" над числами 5({bin(5)}) и 6 ({bin(6)})= {5 & 6} ({bin(5 & 6)})')
print(f'Логическое "ИЛИ" над числами 5({bin(5)}) и 6 ({bin(6)})= {5 | 6} ({bin(5 | 6)})')
print(f'Логическое "Исключительное ИЛИ" над числами 5({bin(5)}) и 6 ({bin(6)})= {5 ^ 6} ({bin(5 ^ 6)})')
print(f'Побитовый сдвиг числа 5({bin(5)}) вправо= {5 >> 2} ({bin(5 >> 2)})')
print(f'Побитовый сдвиг числа 5({bin(5)}) влево= {5 << 2} ({bin(5 << 2)})')
